In [1]:
import pandas as pd
boardgames_df = pd.read_csv("../data/raw/boardgames_df_raw.csv")



boardgames_df["minimum_age"] = boardgames_df["minimum_age"].replace(0, 4)
age_df = boardgames_df[["minimum_age"]]

# Save to new CSV
age_df.to_csv("age.csv", index=False, header=True)

age_df

      minimum_age
0              14
1              13
2              14
3              14
4              14
...           ...
1995           10
1996           14
1997            8
1998           12
1999           12

[2000 rows x 1 columns]

In [5]:
age_df = pd.DataFrame({"age_id": [id+1 for id in range(age_df['minimum_age'].nunique())], "minimum_age": age_df['minimum_age'].unique()})

    age_id  minimum_age
0        1           14
1        2           13
2        3           12
3        4           10
4        5            8
5        6           15
6        7           17
7        8            9
8        9           18
9       10            7
10      11           11
11      12           16
12      13            6
13      14            4
14      15            5

In [ ]:
categories_df = pd.DataFrame({"categories_id": [id+1 for id in range(age_df['categories'].nunique())], "categories": age_df['categories'].unique()})

In [2]:
import pandas as pd
boardgames_df = pd.read_csv("../data/raw/boardgames_df_raw.csv")
boardgames_df
player_df = boardgames_df[["min_players", "max_players"]]

# Save to new CSV
player_df.to_csv("player.csv", index=False)

player_df

      min_players  max_players
0               2            4
1               2            4
2               1            4
3               1            4
4               3            6
...           ...          ...
1995            2            5
1996            3            6
1997            1            6
1998            1            2
1999            1            2

[2000 rows x 2 columns]

In [ ]:
complexity_df = boardgames_df[["complexity"]]

# Save to new CSV
complexity_df.to_csv("complexity.csv", index=False)

complexity_df

In [ ]:
playtime_df = boardgames_df[["min_playtime", "max_playtime"]]

# Save to new CSV
playtime_df.to_csv("playtime.csv", index=False)

playtime_df